var Res = {
    inviteLine1: "Присоединяйтесь, заходите на",
    inviteLine3: "в браузере своего сотового!",
    volumeOff: "ВЫКЛ",
    Score: "PTS",
    HiNameChooseYourTeam: "Привет, <b>{name}</b>!<br/>Выбирай свою команду:",//hi, name, choose your team - choose-team-page
    HiNameYouAreInTeamChooseYourRole: "Привет, <b>{name}</b>!<br/>Ты в команде <b>{team}</b>.<br/>Выбери свою роль:", //hi, name, you are in team, choose your role - choose-position-page
    back:"Назад", //back - change-name
    HiNameYouAreInATeamAndShouldAct: "Привет, <b>{name}</b>!<br/>Ты в команде <b>{team}</b>,<br/>и должен <b>{position}</b>.",    //hi, name, your are in team and have to act - controls-page
    EnterYourName: "Введи свой позывной:", //enter your name - login-page
    Enter: "Войти",//enter - login-page
    KickAll: "Выбить всех",//- server-info
    StartGame: "Открыть карты",//- server-info
    Name: "Имя",//- server-info

    Teams: [
        "золото",
        "пурпур",
        "нефрит"
    ],
    TeamStyles: [
        "gold",
        "#9c27b0",
        "#4CAF50"
    ],

    Roles: {
        ManageRole:'руководить',
        ManageGood:'Хвалить',
        ManageBad:'Ругать',
        ShootRole:'атаковать',
        Shoot:'Огонь!',
        TurretRole:'наводить',
        TurretLeft:'Орудие влево',
        TurretRight:'Орудие вправо',
        MoveRole:'вести',
        ForwardRole:'-вести вперёд-',
        Forward:'В атаку!',
        BackwardRole:'-вести назад-',
        Backward:'Отступаем!',
        TurnRole:'направлять',
        LeftRole:'-левее-',
        Left:'Лево руля!',
        RightRole:'-правее-',
        Right:'Право руля!'
    },

    ManagerGoodPhrases: [
        "Вперёд!",
        "Так держать!",
        "Молодцы!",
        "Всем по премии!",
        "Премия +50% каждому!",
        "Больше ништяков!",
        "Страна вами гордится!",
        "Гагарин бы вами гордился!",
        "Чувствуется русская инженерная школа!",
        "Быстрее! Выше! Сильнее!",
        "Вместе мы – сила!",
        "Дави их!",
    ],
    ManagerBadPhrases: [
        "Кто вас такому учил?",
        "Куда это годится?!",
        "Всех уволю!",
        "Ты работаешь хуже Семёна!",
        "Все останетесь без премии!",
        "Вы позорите Родину!",
        "Ну, соберитесь уже!",
        "Вы – слабое звено!",
        "Гагарин смог, а вы – нет...",
        "Тут делов на три минуты!",
        "Перехвалил!",
        "Вы вообще читали воинский устав?",
        "Нам нечем ответить противнику!",
    ],

    generatedNamesAdjectives: 
        ["агрессивный",
        "безрассудный",
        "бескомпромиссный",
        "отважный",
        "неуловимый",
        "неустрашимый",
        "благоразумный",
        "дерзкий",
        "воинственный",
        "непревзойденный",
        "свирепый",
        "злопамятный",
        "яростный",
        "темпераментный",
        "доблестный",
        "выдающийся",
        "неотразимый",
        "мечтательный",
        "образцовый",
        "добродушный"],
    generatedNamesNouns:
        ["стратег",
        "девелопер",
        "тестировщик",
        "менеджер",
        "кодер",
        "архитектор",
        "военачальник",
        "теоретик",
        "идеалист",
        "агитатор",
        "стажер",
        "хакер",
        "исследователь",
        "экспериментатор",
        "лидер"],    
}